app/views/payment_transactions/new.html.erb

    <%= form.label :subject_id, 'Subject:' %>
    <%= form.select :subject_id, options_for_select(@subjects.map { |s| [s.id.to_s + " - " + s.subjectable_type + " - " + s.name.upcase, s.id] }), {}, class: 'form-control' %>
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."subjectable_id" != ?  [["subjectable_id", 1]]