app/helpers/payment_transaction_helper.rb

    def valid_subjects(user)
      Subject.where.not(subject_id: user.subject.id)
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def withdraw(subject, params)
      check_balance(subject, params[:amount])

      ActiveRecord::Base.transaction do
        my_transaction = PaymentTransaction.new
        my_transaction.subject_id = subject.id
        my_transaction.amount = params[:amount]
        my_transaction.transaction_type = 'debit'
        my_transaction.transaction_time = Time.now
        my_transaction.notes = "Withdraw"
        my_transaction.save!
---
INSERT INTO "payment_transactions" ("amount", "transaction_type", "transaction_time", "notes", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def deposit(subject, params)
      ActiveRecord::Base.transaction do
        my_transaction = PaymentTransaction.new
        my_transaction.subject_id = subject.id
        my_transaction.amount = params[:amount]
        my_transaction.transaction_type = 'credit'
        my_transaction.transaction_time = Time.now
        my_transaction.notes = "Deposit"
        my_transaction.save!
---
INSERT INTO "payment_transactions" ("amount", "transaction_type", "transaction_time", "notes", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def create(subject, params)
      check_balance(subject, params[:amount])

      ActiveRecord::Base.transaction do
        target_subject = Subject.find(params[:subject_id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]