app/controllers/dashboard_controller.rb

SELECT "payment_transactions".* FROM "payment_transactions" WHERE "payment_transactions"."subject_id" = ?  [["subject_id", 1]]
---
  def index
    @user = current_user
    @subject = @user.subject
    @payment_transactions = @subject.payment_transactions.order(id: :desc)