app/controllers/payment_transactions_controller.rb

  def create
    @payment_transaction = PaymentTransaction.new
    result = ::PaymentTransactionHelper::Transaction.new.create(current_user.subject, params[:payment_transaction])
---
INSERT INTO "payment_transactions" ("amount", "transaction_type", "transaction_time", "notes", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)