app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "john@example.com"], ["LIMIT", 1]]
---
  def authenticate
    @user = User.find_by(email: params[:email])